
[

    
        
    
        
    
        
    
        
    
        
    
        
    
        
    




    
    {
        "title": "Partisi pada Hard Disk Drive",
        "content": "Partisi\nPartisi adalah pembagian ruang Hard Disk Drive (HDD) secara logis. Pembagian ini bertujuan untuk memudahkan manajemen pemnyimpanan di HDD. Misalnya sebuah HDD dibagi menjadi tiga bagian. Bagian pertama untuk meletakkan sistem operasi, bagian kedua untuk menyimpan proyek dan tugas kuliah, dan bagian ketiga untuk menyimpan foto dan video. Dengan membagi-bagi HDD seperti ini kerusakan filesystem juga dapat diminimalisir karena kerusakan ini bersifat lokal dalam sebuah partisi, sehingga apabila sebuah partisi rusak (corrupt) maka partisi lainnya tidak terkena dampaknya.\n\nDalam sistem operasi keluarga microsoft (DOS, Windows) setiap partisi HDD dilambangkan dengan sebuah abjad dan diikuti dengan titik dua. misalkan C:, D:, E:, dan seterusnya. Pada Linux dan sistem Unix-like lain sebuah partisi direpresentasikan dengan sebuah file dalam direktori /dev/, misalnya /dev/sda1, /dev/sda2, dan seterusnya. Untuk dapat mengakses partisi-partisi yang ada maka perlu dikaitkan ke sistem operasi terlebih dahulu. misalkan sda2 dikaitkan kedalam direktori /mnt/videos maka seluruh berkas yang ada di sda2 akan muncul dan dapat diakses di /mnt/videos. lihat ilustrasi berikut.\n\n\nmengaitkan partisi\n\nTabel Partisi\nTabel partisi mendeskripsikan partisi-partisi yang ada dalam sebuah HDD. Tipe tabel partisi dapat diubah sesuai keinginan namun berakibat pada hilangnya seluruh data dalam HDD dan seluruh susunan partisinya. Jika ingin melakukan pengubahan tipe tabel sebaiknya backup data-data yang penting ke penyimpanan lain.\n\nAda dua jenis tabel partisi yang sering digunakan:\n\n1. Master Boot Record (MBR)\n\nTabel partisi MBR memiliki boot sector yang terletak di bagian paling awal dari sebuah HDD, yang disebut sebagai MBR. MBR ini menampung informasi tentang bagaimana partisi-partisi yang ada diorganisir. Selain itu MBR juga berisi tentang dimana lokasi sistem operasi yang harus di-boot. Jenis tabel partisi ini banyak digunakan pada PC generasi lama. HDD yang diatur dengan tipe tabel ini hanya mampu menampung empat partisi primer, namun dapat dibuat lebih banyak partisi lagi dengan menggunakan partisi primer bertipe extended. Karena merupakan generasi lama, MBR hanya dapat diterapkan pada HDD dengan kapasitas maksimal 2TiB.\n\n\nilustrasi pengalokasian HDD dengan tabel MBR\n\nKetika bootloader sebuah sistem operasi dipasang maka akan secara otomatis mengubah informasi lokasi dimana bootloader tersebut dipasang. Misalkan sebuah PC dipasang sistem operasi linux di sda1, maka MBR akan berisi informasi bahwa bootloader berada di sda1. Ketika dipasang lagi sistem operasi windows di sda2 maka MBR juga akan berubah untuk menunjukkan lokasi bootloader berada di sda2. Itulah mengapa sebaiknya untuk dual boot sistem operasi windows dengan Linux sangat disarankan untuk mengakhirkan Linux karena bootloader Linux mau mendeteksi bootloader windows, namun tidak sebaliknya.\n\n2. GUID Partition Table (GPT)\n\nGUID Partition Table atau GPT adalah tipe tabel partisi yang lebih modern dari MBR. GPT ini sering digunakan di PC generasi sekitar kemunculan windows 8 hingga sekarang. Berbeda dengan MBR, GPT mendukung HDD dengan kapasitas 8ZiB. Selain itu GPT juga\n",
        "link": "/partisi-hdd",
        "date": "2017-08-02 00:18:00 +0000",
        "excerpt": "",
        "search_omit": ""
    }
    
    

    
    ,{
        "title": "Situs ini ditenagai oleh Jekyll",
        "content": "Halo semua.\n\nSitus ini dibuat dengan menggunakan Jekyll dan mendukung bahasa indonesia dan bahasa inggris.\nSemoga dengan ini kemampuan bahasa inggris dan menulis saya meningkat.\n",
        "link": "/my-jekyll-powered-site-has-created",
        "date": "2017-01-01 08:00:00 +0000",
        "excerpt": "",
        "search_omit": ""
    }
    
    



    
    ,{
        "title": "Page Not Found",
        "content": "Seems disappeared :(\n",
        "link": "/404.html",
        "date": null,
        "excerpt": null,
        "search_omit": ""
    }
    
    

    
    ,{
        "title": "navs.about",
        "content": "Selamat datang :D\n\n\n  This website is using laobubu’s theme: EasyBook\n\n\n",
        "link": "/about/",
        "date": null,
        "excerpt": null,
        "search_omit": ""
    }
    
    

    
    ,{
        "title": "navs.category",
        "content": "\n  Kategori\n\n  \n\n\n\n\n\nJEKYLL\n\n\nJan 01 » Situs ini ditenagai oleh Jekyll\n\n\n\n\nPENGETAHUAN\n\n\nAug 02 » Partisi pada Hard Disk Drive\n\n\n\n\n  \n\n\n",
        "link": "/category/",
        "date": null,
        "excerpt": null,
        "search_omit": ""
    }
    
    

    

    

    
    ,{
        "title": "Search",
        "content": "  Search\n\n  \n  \n    Search term\n    \n    \n  \n\n  \n  \n     result(s) found for &ldquo;&rdquo;.\n  \n  \n\n\n\n  \n  \n    \n  \n\n  \n  \n\n  \n  \n",
        "link": "/search/",
        "date": null,
        "excerpt": null,
        "search_omit": "false"
    }
    
    

    
    ,{
        "title": "global.articles",
        "content": "\n  RSS Feed\n  {% t page.title %}\n\n  \n    {% for post in paginator.posts %}\n      \n        \n          {{ post.title }}\n        \n\n        {{ post.date | date: \"%b %-d, %Y\" }}\n\n        \n          {{ post.excerpt }}\n          \n            Read More &raquo;\n          \n        \n      \n    {% endfor %}\n  \n\n  \n\n  {% if paginator.previous_page %}\n    PREV\n  {% else %}\n    PREV\n  {% endif %}\n  {{ paginator.page }} of {{ paginator.total_pages }}\n  {% if paginator.next_page %}\n    NEXT\n  {% else %}\n    NEXT\n  {% endif %}\n\n\n\n",
        "link": "/",
        "date": null,
        "excerpt": null,
        "search_omit": ""
    }
    
    

    

]
